GopalSaraf/Practicals/PSDL/include/proc/pic16f15276.h
#define                                 RD0PPS5_bit         _BIT_ACCESS(RD0PPS,5)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x79);	// @ (0xF * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// T1CON<RD16>
extern volatile __bit                   RD16                __at(0x1071);	// @ (0x20E * 8 + 1)
#define                                 RD16_bit            _BIT_ACCESS(T1CON,1)
// T1CON<RD161>
extern volatile __bit                   RD161               __at(0x1071);	// @ (0x20E * 8 + 1)
#define                                 RD161_bit           _BIT_ACCESS(T1CON,1)
// RD1PPS<RD1PPS0>
extern volatile __bit                   RD1PPS0             __at(0xF948);	// @ (0x1F29 * 8 + 0)
#define                                 RD1PPS0_bit         _BIT_ACCESS(RD1PPS,0)
// RD1PPS<RD1PPS1>
extern volatile __bit                   RD1PPS1             __at(0xF949);	// @ (0x1F29 * 8 + 1)
#define                                 RD1PPS1_bit         _BIT_ACCESS(RD1PPS,1)
// RD1PPS<RD1PPS2>
extern volatile __bit                   RD1PPS2             __at(0xF94A);	// @ (0x1F29 * 8 + 2)
#define                                 RD1PPS2_bit         _BIT_ACCESS(RD1PPS,2)
// RD1PPS<RD1PPS3>
extern volatile __bit                   RD1PPS3             __at(0xF94B);	// @ (0x1F29 * 8 + 3)
#define                                 RD1PPS3_bit         _BIT_ACCESS(RD1PPS,3)
// RD1PPS<RD1PPS4>
extern volatile __bit                   RD1PPS4             __at(0xF94C);	// @ (0x1F29 * 8 + 4)
#define                                 RD1PPS4_bit         _BIT_ACCESS(RD1PPS,4)
// RD1PPS<RD1PPS5>
extern volatile __bit                   RD1PPS5             __at(0xF94D);	// @ (0x1F29 * 8 + 5)
#define                                 RD1PPS5_bit         _BIT_ACCESS(RD1PPS,5)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x7A);	// @ (0xF * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// RD2PPS<RD2PPS0>
extern volatile __bit                   RD2PPS0             __at(0xF950);	// @ (0x1F2A * 8 + 0)
#define                                 RD2PPS0_bit         _BIT_ACCESS(RD2PPS,0)
// RD2PPS<RD2PPS1>
extern volatile __bit                   RD2PPS1             __at(0xF951);	// @ (0x1F2A * 8 + 1)
#define                                 RD2PPS1_bit         _BIT_ACCESS(RD2PPS,1)
// RD2PPS<RD2PPS2>
extern volatile __bit                   RD2PPS2             __at(0xF952);	// @ (0x1F2A * 8 + 2)
#define                                 RD2PPS2_bit         _BIT_ACCESS(RD2PPS,2)
// RD2PPS<RD2PPS3>
extern volatile __bit                   RD2PPS3             __at(0xF953);	// @ (0x1F2A * 8 + 3)
#define                                 RD2PPS3_bit         _BIT_ACCESS(RD2PPS,3)
// RD2PPS<RD2PPS4>
extern volatile __bit                   RD2PPS4             __at(0xF954);	// @ (0x1F2A * 8 + 4)
#define                                 RD2PPS4_bit         _BIT_ACCESS(RD2PPS,4)
// RD2PPS<RD2PPS5>
extern volatile __bit                   RD2PPS5             __at(0xF955);	// @ (0x1F2A * 8 + 5)
#define                                 RD2PPS5_bit         _BIT_ACCESS(RD2PPS,5)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x7B);	// @ (0xF * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// RD3PPS<RD3PPS0>
extern volatile __bit                   RD3PPS0             __at(0xF958);	// @ (0x1F2B * 8 + 0)
#define                                 RD3PPS0_bit         _BIT_ACCESS(RD3PPS,0)
// RD3PPS<RD3PPS1>
extern volatile __bit                   RD3PPS1             __at(0xF959);	// @ (0x1F2B * 8 + 1)
#define                                 RD3PPS1_bit         _BIT_ACCESS(RD3PPS,1)
// RD3PPS<RD3PPS2>
extern volatile __bit                   RD3PPS2             __at(0xF95A);	// @ (0x1F2B * 8 + 2)
#define                                 RD3PPS2_bit         _BIT_ACCESS(RD3PPS,2)
// RD3PPS<RD3PPS3>
extern volatile __bit                   RD3PPS3             __at(0xF95B);	// @ (0x1F2B * 8 + 3)
#define                                 RD3PPS3_bit         _BIT_ACCESS(RD3PPS,3)
// RD3PPS<RD3PPS4>
extern volatile __bit                   RD3PPS4             __at(0xF95C);	// @ (0x1F2B * 8 + 4)
#define                                 RD3PPS4_bit         _BIT_ACCESS(RD3PPS,4)
// RD3PPS<RD3PPS5>
extern volatile __bit                   RD3PPS5             __at(0xF95D);	// @ (0x1F2B * 8 + 5)
#define                                 RD3PPS5_bit         _BIT_ACCESS(RD3PPS,5)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x7C);	// @ (0xF * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// RD4PPS<RD4PPS0>
extern volatile __bit                   RD4PPS0             __at(0xF960);	// @ (0x1F2C * 8 + 0)
#define                                 RD4PPS0_bit         _BIT_ACCESS(RD4PPS,0)
// RD4PPS<RD4PPS1>
extern volatile __bit                   RD4PPS1             __at(0xF961);	// @ (0x1F2C * 8 + 1)
#define                                 RD4PPS1_bit         _BIT_ACCESS(RD4PPS,1)
// RD4PPS<RD4PPS2>
extern volatile __bit                   RD4PPS2             __at(0xF962);	// @ (0x1F2C * 8 + 2)
#define                                 RD4PPS2_bit         _BIT_ACCESS(RD4PPS,2)
// RD4PPS<RD4PPS3>
extern volatile __bit                   RD4PPS3             __at(0xF963);	// @ (0x1F2C * 8 + 3)
#define                                 RD4PPS3_bit         _BIT_ACCESS(RD4PPS,3)
// RD4PPS<RD4PPS4>
extern volatile __bit                   RD4PPS4             __at(0xF964);	// @ (0x1F2C * 8 + 4)
#define                                 RD4PPS4_bit         _BIT_ACCESS(RD4PPS,4)
// RD4PPS<RD4PPS5>
extern volatile __bit                   RD4PPS5             __at(0xF965);	// @ (0x1F2C * 8 + 5)
#define                                 RD4PPS5_bit         _BIT_ACCESS(RD4PPS,5)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x7D);	// @ (0xF * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// RD5PPS<RD5PPS0>
extern volatile __bit                   RD5PPS0             __at(0xF968);	// @ (0x1F2D * 8 + 0)
#define                                 RD5PPS0_bit         _BIT_ACCESS(RD5PPS,0)
// RD5PPS<RD5PPS1>
extern volatile __bit                   RD5PPS1             __at(0xF969);	// @ (0x1F2D * 8 + 1)
#define                                 RD5PPS1_bit         _BIT_ACCESS(RD5PPS,1)
// RD5PPS<RD5PPS2>
extern volatile __bit                   RD5PPS2             __at(0xF96A);	// @ (0x1F2D * 8 + 2)
#define                                 RD5PPS2_bit         _BIT_ACCESS(RD5PPS,2)
// RD5PPS<RD5PPS3>
extern volatile __bit                   RD5PPS3             __at(0xF96B);	// @ (0x1F2D * 8 + 3)
#define                                 RD5PPS3_bit         _BIT_ACCESS(RD5PPS,3)
// RD5PPS<RD5PPS4>
extern volatile __bit                   RD5PPS4             __at(0xF96C);	// @ (0x1F2D * 8 + 4)
#define                                 RD5PPS4_bit         _BIT_ACCESS(RD5PPS,4)
// RD5PPS<RD5PPS5>
extern volatile __bit                   RD5PPS5             __at(0xF96D);	// @ (0x1F2D * 8 + 5)
#define                                 RD5PPS5_bit         _BIT_ACCESS(RD5PPS,5)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x7E);	// @ (0xF * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// RD6PPS<RD6PPS0>
extern volatile __bit                   RD6PPS0             __at(0xF970);	// @ (0x1F2E * 8 + 0)
#define                                 RD6PPS0_bit         _BIT_ACCESS(RD6PPS,0)
// RD6PPS<RD6PPS1>
extern volatile __bit                   RD6PPS1             __at(0xF971);	// @ (0x1F2E * 8 + 1)
#define                                 RD6PPS1_bit         _BIT_ACCESS(RD6PPS,1)
// RD6PPS<RD6PPS2>
extern volatile __bit                   RD6PPS2             __at(0xF972);	// @ (0x1F2E * 8 + 2)
#define                                 RD6PPS2_bit         _BIT_ACCESS(RD6PPS,2)
// RD6PPS<RD6PPS3>
extern volatile __bit                   RD6PPS3             __at(0xF973);	// @ (0x1F2E * 8 + 3)
#define                                 RD6PPS3_bit         _BIT_ACCESS(RD6PPS,3)
// RD6PPS<RD6PPS4>
extern volatile __bit                   RD6PPS4             __at(0xF974);	// @ (0x1F2E * 8 + 4)
#define                                 RD6PPS4_bit         _BIT_ACCESS(RD6PPS,4)
// RD6PPS<RD6PPS5>
extern volatile __bit                   RD6PPS5             __at(0xF975);	// @ (0x1F2E * 8 + 5)
#define                                 RD6PPS5_bit         _BIT_ACCESS(RD6PPS,5)
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x7F);	// @ (0xF * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// RD7PPS<RD7PPS0>
extern volatile __bit                   RD7PPS0             __at(0xF978);	// @ (0x1F2F * 8 + 0)
#define                                 RD7PPS0_bit         _BIT_ACCESS(RD7PPS,0)
// RD7PPS<RD7PPS1>
extern volatile __bit                   RD7PPS1             __at(0xF979);	// @ (0x1F2F * 8 + 1)
#define                                 RD7PPS1_bit         _BIT_ACCESS(RD7PPS,1)
// RD7PPS<RD7PPS2>
extern volatile __bit                   RD7PPS2             __at(0xF97A);	// @ (0x1F2F * 8 + 2)
#define                                 RD7PPS2_bit         _BIT_ACCESS(RD7PPS,2)
// RD7PPS<RD7PPS3>
extern volatile __bit                   RD7PPS3             __at(0xF97B);	// @ (0x1F2F * 8 + 3)
#define                                 RD7PPS3_bit         _BIT_ACCESS(RD7PPS,3)
// RD7PPS<RD7PPS4>
extern volatile __bit                   RD7PPS4             __at(0xF97C);	// @ (0x1F2F * 8 + 4)
#define                                 RD7PPS4_bit         _BIT_ACCESS(RD7PPS,4)
// RD7PPS<RD7PPS5>
extern volatile __bit                   RD7PPS5             __at(0xF97D);	// @ (0x1F2F * 8 + 5)
#define                                 RD7PPS5_bit         _BIT_ACCESS(RD7PPS,5)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x80);	// @ (0x10 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// RE0PPS<RE0PPS0>
extern volatile __bit                   RE0PPS0             __at(0xF980);	// @ (0x1F30 * 8 + 0)
#define                                 RE0PPS0_bit         _BIT_ACCESS(RE0PPS,0)
// RE0PPS<RE0PPS1>
extern volatile __bit                   RE0PPS1             __at(0xF981);	// @ (0x1F30 * 8 + 1)
#define                                 RE0PPS1_bit         _BIT_ACCESS(RE0PPS,1)
// RE0PPS<RE0PPS2>
extern volatile __bit                   RE0PPS2             __at(0xF982);	// @ (0x1F30 * 8 + 2)
#define                                 RE0PPS2_bit         _BIT_ACCESS(RE0PPS,2)
// RE0PPS<RE0PPS3>
extern volatile __bit                   RE0PPS3             __at(0xF983);	// @ (0x1F30 * 8 + 3)
#define                                 RE0PPS3_bit         _BIT_ACCESS(RE0PPS,3)
// RE0PPS<RE0PPS4>
extern volatile __bit                   RE0PPS4             __at(0xF984);	// @ (0x1F30 * 8 + 4)
#define                                 RE0PPS4_bit         _BIT_ACCESS(RE0PPS,4)
// RE0PPS<RE0PPS5>
extern volatile __bit                   RE0PPS5             __at(0xF985);	// @ (0x1F30 * 8 + 5)
#define                                 RE0PPS5_bit         _BIT_ACCESS(RE0PPS,5)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x81);	// @ (0x10 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// RE1PPS<RE1PPS0>
extern volatile __bit                   RE1PPS0             __at(0xF988);	// @ (0x1F31 * 8 + 0)
#define                                 RE1PPS0_bit         _BIT_ACCESS(RE1PPS,0)
// RE1PPS<RE1PPS1>
extern volatile __bit                   RE1PPS1             __at(0xF989);	// @ (0x1F31 * 8 + 1)
#define                                 RE1PPS1_bit         _BIT_ACCESS(RE1PPS,1)
// RE1PPS<RE1PPS2>
extern volatile __bit                   RE1PPS2             __at(0xF98A);	// @ (0x1F31 * 8 + 2)
#define                                 RE1PPS2_bit         _BIT_ACCESS(RE1PPS,2)
// RE1PPS<RE1PPS3>
extern volatile __bit                   RE1PPS3             __at(0xF98B);	// @ (0x1F31 * 8 + 3)
#define                                 RE1PPS3_bit         _BIT_ACCESS(RE1PPS,3)
// RE1PPS<RE1PPS4>
extern volatile __bit                   RE1PPS4             __at(0xF98C);	// @ (0x1F31 * 8 + 4)
#define                                 RE1PPS4_bit         _BIT_ACCESS(RE1PPS,4)
// RE1PPS<RE1PPS5>
extern volatile __bit                   RE1PPS5             __at(0xF98D);	// @ (0x1F31 * 8 + 5)
#define                                 RE1PPS5_bit         _BIT_ACCESS(RE1PPS,5)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x82);	// @ (0x10 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// RE2PPS<RE2PPS0>
extern volatile __bit                   RE2PPS0             __at(0xF990);	// @ (0x1F32 * 8 + 0)
#define                                 RE2PPS0_bit         _BIT_ACCESS(RE2PPS,0)
// RE2PPS<RE2PPS1>
extern volatile __bit                   RE2PPS1             __at(0xF991);	// @ (0x1F32 * 8 + 1)
#define                                 RE2PPS1_bit         _BIT_ACCESS(RE2PPS,1)
// RE2PPS<RE2PPS2>
extern volatile __bit                   RE2PPS2             __at(0xF992);	// @ (0x1F32 * 8 + 2)
#define                                 RE2PPS2_bit         _BIT_ACCESS(RE2PPS,2)
// RE2PPS<RE2PPS3>
extern volatile __bit                   RE2PPS3             __at(0xF993);	// @ (0x1F32 * 8 + 3)
#define                                 RE2PPS3_bit         _BIT_ACCESS(RE2PPS,3)
// RE2PPS<RE2PPS4>
extern volatile __bit                   RE2PPS4             __at(0xF994);	// @ (0x1F32 * 8 + 4)
#define                                 RE2PPS4_bit         _BIT_ACCESS(RE2PPS,4)
// RE2PPS<RE2PPS5>
extern volatile __bit                   RE2PPS5             __at(0xF995);	// @ (0x1F32 * 8 + 5)
#define                                 RE2PPS5_bit         _BIT_ACCESS(RE2PPS,5)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSP1STAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<READ_WRITE1>
extern volatile __bit                   READ_WRITE1         __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 READ_WRITE1_bit     _BIT_ACCESS(SSP1STAT,2)
// T2RST<RSEL0>
extern volatile __bit                   RSEL0               __at(0x1488);	// @ (0x291 * 8 + 0)
#define                                 RSEL0_bit           _BIT_ACCESS(T2RST,0)
// T2RST<RSEL1>
extern volatile __bit                   RSEL1               __at(0x1489);	// @ (0x291 * 8 + 1)
#define                                 RSEL1_bit           _BIT_ACCESS(T2RST,1)
// T2RST<RSEL2>
extern volatile __bit                   RSEL2               __at(0x148A);	// @ (0x291 * 8 + 2)
#define                                 RSEL2_bit           _BIT_ACCESS(T2RST,2)
// T2RST<RSEL3>
extern volatile __bit                   RSEL3               __at(0x148B);	// @ (0x291 * 8 + 3)
#define                                 RSEL3_bit           _BIT_ACCESS(T2RST,3)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0xC89);	// @ (0x191 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0xC89);	// @ (0x191 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SSP1STAT<RW>
extern volatile __bit                   RW                  __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// RX1PPS<RX1DTPPS0>
extern volatile __bit                   RX1DTPPS0           __at(0xF658);	// @ (0x1ECB * 8 + 0)
#define                                 RX1DTPPS0_bit       _BIT_ACCESS(RX1PPS,0)
// RX1PPS<RX1DTPPS1>
extern volatile __bit                   RX1DTPPS1           __at(0xF659);	// @ (0x1ECB * 8 + 1)
#define                                 RX1DTPPS1_bit       _BIT_ACCESS(RX1PPS,1)
// RX1PPS<RX1DTPPS2>
extern volatile __bit                   RX1DTPPS2           __at(0xF65A);	// @ (0x1ECB * 8 + 2)
#define                                 RX1DTPPS2_bit       _BIT_ACCESS(RX1PPS,2)
// RX1PPS<RX1DTPPS3>
extern volatile __bit                   RX1DTPPS3           __at(0xF65B);	// @ (0x1ECB * 8 + 3)
#define                                 RX1DTPPS3_bit       _BIT_ACCESS(RX1PPS,3)
// RX1PPS<RX1DTPPS4>
extern volatile __bit                   RX1DTPPS4           __at(0xF65C);	// @ (0x1ECB * 8 + 4)
#define                                 RX1DTPPS4_bit       _BIT_ACCESS(RX1PPS,4)
// RC1STA<RX9>
extern volatile __bit                   RX9                 __at(0x8EE);	// @ (0x11D * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RC1STA,6)
// RC1STA<RX9D>
extern volatile __bit                   RX9D                __at(0x8E8);	// @ (0x11D * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RC1STA,0)
// SSP1STAT<R_W>
extern volatile __bit                   R_W                 __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_W1>
extern volatile __bit                   R_W1                __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_W1_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_nW>
extern volatile __bit                   R_nW                __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_nW1>
extern volatile __bit                   R_nW1               __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_nW1_bit           _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<S2>
extern volatile __bit                   S2                  __at(0xC7B);	// @ (0x18F * 8 + 3)
#define                                 S2_bit              _BIT_ACCESS(SSP1STAT,3)
// SSP1CON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0xC92);	// @ (0x192 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSP1CON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x408F);	// @ (0x811 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SSP1CON3<SCIE>
extern volatile __bit                   SCIE                __at(0xC95);	// @ (0x192 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSP1CON3,5)
// BAUD1CON<SCKP>
extern volatile __bit                   SCKP                __at(0x8FC);	// @ (0x11F * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUD1CON,4)
// SSP1CON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0xC93);	// @ (0x192 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSP1CON3,3)
// SSP1CON2<SEN1>
extern volatile __bit                   SEN1                __at(0xC88);	// @ (0x191 * 8 + 0)
#define                                 SEN1_bit            _BIT_ACCESS(SSP1CON2,0)
// TX1STA<SENDB>
extern volatile __bit                   SENDB               __at(0x8F3);	// @ (0x11E * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TX1STA,3)
// OSCSTAT<SFOR>
extern volatile __bit                   SFOR                __at(0x4481);	// @ (0x890 * 8 + 1)
#define                                 SFOR_bit            _BIT_ACCESS(OSCSTAT,1)
// SLRCONA<SLRA0>
extern volatile __bit                   SLRA0               __at(0xF9D8);	// @ (0x1F3B * 8 + 0)
#define                                 SLRA0_bit           _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRA1>
extern volatile __bit                   SLRA1               __at(0xF9D9);	// @ (0x1F3B * 8 + 1)
#define                                 SLRA1_bit           _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRA2>
extern volatile __bit                   SLRA2               __at(0xF9DA);	// @ (0x1F3B * 8 + 2)
#define                                 SLRA2_bit           _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRA3>
extern volatile __bit                   SLRA3               __at(0xF9DB);	// @ (0x1F3B * 8 + 3)
#define                                 SLRA3_bit           _BIT_ACCESS(SLRCONA,3)
// SLRCONA<SLRA4>
extern volatile __bit                   SLRA4               __at(0xF9DC);	// @ (0x1F3B * 8 + 4)
#define                                 SLRA4_bit           _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRA5>
extern volatile __bit                   SLRA5               __at(0xF9DD);	// @ (0x1F3B * 8 + 5)
#define                                 SLRA5_bit           _BIT_ACCESS(SLRCONA,5)
// SLRCONA<SLRA6>
extern volatile __bit                   SLRA6               __at(0xF9DE);	// @ (0x1F3B * 8 + 6)
#define                                 SLRA6_bit           _BIT_ACCESS(SLRCONA,6)
// SLRCONA<SLRA7>
extern volatile __bit                   SLRA7               __at(0xF9DF);	// @ (0x1F3B * 8 + 7)
#define                                 SLRA7_bit           _BIT_ACCESS(SLRCONA,7)
// SLRCONB<SLRB0>
extern volatile __bit                   SLRB0               __at(0xFA30);	// @ (0x1F46 * 8 + 0)
#define                                 SLRB0_bit           _BIT_ACCESS(SLRCONB,0)
// SLRCONB<SLRB1>
extern volatile __bit                   SLRB1               __at(0xFA31);	// @ (0x1F46 * 8 + 1)
#define                                 SLRB1_bit           _BIT_ACCESS(SLRCONB,1)
// SLRCONB<SLRB2>
extern volatile __bit                   SLRB2               __at(0xFA32);	// @ (0x1F46 * 8 + 2)
#define                                 SLRB2_bit           _BIT_ACCESS(SLRCONB,2)
// SLRCONB<SLRB3>
extern volatile __bit                   SLRB3               __at(0xFA33);	// @ (0x1F46 * 8 + 3)
#define                                 SLRB3_bit           _BIT_ACCESS(SLRCONB,3)
// SLRCONB<SLRB4>
extern volatile __bit                   SLRB4               __at(0xFA34);	// @ (0x1F46 * 8 + 4)
#define                                 SLRB4_bit           _BIT_ACCESS(SLRCONB,4)
// SLRCONB<SLRB5>
extern volatile __bit                   SLRB5               __at(0xFA35);	// @ (0x1F46 * 8 + 5)
#define                                 SLRB5_bit           _BIT_ACCESS(SLRCONB,5)
// SLRCONB<SLRB6>
extern volatile __bit                   SLRB6               __at(0xFA36);	// @ (0x1F46 * 8 + 6)
#define                                 SLRB6_bit           _BIT_ACCESS(SLRCONB,6)
// SLRCONB<SLRB7>
extern volatile __bit                   SLRB7               __at(0xFA37);	// @ (0x1F46 * 8 + 7)
#define                                 SLRB7_bit           _BIT_ACCESS(SLRCONB,7)
// SLRCONC<SLRC0>
extern volatile __bit                   SLRC0               __at(0xFA88);	// @ (0x1F51 * 8 + 0)
#define                                 SLRC0_bit           _BIT_ACCESS(SLRCONC,0)
// SLRCONC<SLRC1>
extern volatile __bit                   SLRC1               __at(0xFA89);	// @ (0x1F51 * 8 + 1)
#define                                 SLRC1_bit           _BIT_ACCESS(SLRCONC,1)
// SLRCONC<SLRC2>
extern volatile __bit                   SLRC2               __at(0xFA8A);	// @ (0x1F51 * 8 + 2)
#define                                 SLRC2_bit           _BIT_ACCESS(SLRCONC,2)
// SLRCONC<SLRC3>
